clear all
sr3 = serial('COM4','BaudRate',9600); % ä½¿ç”¨é»˜è®¤è®¾ç½®åˆ›å»ºä¸²å?£ sr3
fopen(sr3); %æ‰“å¼€ä¸²å?£
%è¯»å?–åˆ°ä½?ä¿¡å?·
Com_num =['01';'01'; '00'; '64'; '00'; '01'; 'BC'; '15']%åŠ äº† CRC æ ¡éªŒçš„å‘½ä»¤åº?åˆ—ã€‚
Com_num = hex2dec(Com_num);
fwrite(sr3,Com_num);%ä¸²å?£å?‘é€?
Read_num= fread(sr3,6);
Read_num= dec2hex(Read_num)%'01 03 00 F2 00 02 65 F8'
Com_num =['01';'03'; '00'; 'F2'; '00'; '02'; '65'; 'F8'];%åŠ äº† CRC æ ¡éªŒçš„å‘½ä»¤åº?åˆ—ã€‚
Com_num = hex2dec(Com_num);
fwrite(sr3,Com_num);%ä¸²å?£å?‘é€?
Read_num= fread(sr3,6);%è¯»å?–ä¸²å?£
Read_num= dec2hex(Read_num)%å¾—åˆ° 01 03 04 00 00 00 00 FA 33 ï¼Œè§£æž?å‡ºæ?¥ä½?ç½®ä¸º 0ã€‚
%è®¾å®š X è½´é€Ÿåº¦ä¸º  '01 10 06 42 00 02 04 00 00 41 20 6C 6E'
Com_num =['01';'10'; '06'; '42'; '00'; '02'; '04'; '00'; '00'; '41'; '20'; '6C'; '6E'];%åŠ äº† CRC æ ¡éªŒçš„å‘½
Com_num = hex2dec(Com_num);
fwrite(sr3,Com_num);%ä¸²å?£å?‘é€?
%è®¾å®š X è½´ä½?ç½®ä¸º 2mm:  '01 10 06 40 00 02 04 00 00 40 00 ED FF'
Com_num =['01';'10'; '06'; '40'; '00'; '02'; '04'; '00'; '00'; '40'; '00'; 'ED'; 'FF'];%åŠ äº† CRC æ ¡éªŒçš„å‘½
Com_num = hex2dec(Com_num);
fwrite(sr3,Com_num);%ä¸²å?£å?‘é€?
%å†™å…¥å?¯åŠ¨æŒ‰é’®ï¼Œ  01 0F 00 96 00 01 01 01 A7 A4
Com_num =['01';'0F'; '00'; '96'; '00'; '01'; '01'; '01'; 'A7'; '4A'];%åŠ äº† CRC æ ¡éªŒçš„å‘½ä»¤åº?åˆ—ã€‚
Com_num = hex2dec(Com_num);
fwrite(sr3,Com_num);%ä¸²å?£å?‘é€?
%å…³é—­å?¯åŠ¨æŒ‰é’®ï¼Œ
Com_num =['01';'0F'; '00'; '96'; '00'; '01'; '01'; '00'; '66'; '8A'];%åŠ äº† CRC æ ¡éªŒçš„å‘½ä»¤åº?åˆ—ã€‚
Com_num = hex2dec(Com_num);
fwrite(sr3,Com_num);%ä¸²å?£å?‘é€?
fclose(sr3); %å…³é—­ä¸²å?£
delete(sr3);